[
  {
    "title": "Xiaomi Redmi K50 Gaming to sport Dimensity 9000",
    "imgUrl": "https://fdn.gsmarena.com/imgroot/news/21/04/redmi-k40-gaming-india/-1200/gsmarena_002.jpg",
    "content": "The Redmi K40 Gaming arrived in April 2021 with a Dimensity 1200, and reports are the successor will use a Mediatek platform as well.\n\n Digital Chat Station reveals the Redmi K50 Gaming is coming with a Dimensity 9000 - the latest flagship platform by the Taiwanese chipmaker. It will keep the 64MP main camera and the 5,000 mAh battery, while the screen will be flat and this time will have a fingerprint scanner underneath.\n\n The internal design of the Redmi K50 Gaming will be slightly different from the K40, allowing for better implementation and performance of the cooling solutions.\n\n We don’t have a launch date of the gaming device, but if we take the Redmi K40 release as a guidance, we should see the regular Redmi K50 series make an appearance in Q1 2022, followed by the Gaming version shortly after.",
    "userId": 1
  },
  {
    "title": "Leak: Huawei nova 8 SE to be re-released as a 4G phone",
    "imgUrl": "https://fdn.gsmarena.com/imgroot/news/21/11/huawei-nova-8-se-4g-leak/inline/-1200/gsmarena_002.jpg",
    "content": "Huawei is having difficulties sourcing parts from abroad, so it has had to be creative with new launches. It looks like the Huawei nova 8 SE from last year is bound for a 4G-only re-release. Here is a look at the spec sheet, courtesy of leakster WHYLAB.\n\n The original model was powered by a Dimensity 720 for the standard model and a Dimensity 800U for the premium model. This re-release will use the Kirin 710A instead – it is the first chipset to be mass produced at China’s SMIC foundry (the chip is fabbed on a 14 nm FinFET process). The phone will come with HarmonyOS 2 out of the box and will be configured with 8 GB of RAM and 128 GB storage.\n\n Unlike the nova 8 SE Youth, which launched earlier this year, also with the Kirin 710A, this model will get to keep the 6.5” OLED display (1080p+, 20:9). Or at least an OLED display, we’re not sure if the panel is the same.\n\n Anyway, it seems that other than the chipset downgrade (and the switch back to 4G that comes with it), the phone will be mostly the same. This includes the 3,800 mAh battery with 66W fast charging over USB-C.\n\n Also the camera setup, starting with the 64 MP main camera (f/1.9 aperture) and 8 MP ultra wide cam, followed by 2 MP macro and depth cameras. The selfie camera is getting a 16 MP sensor (f/2.0). Even the phone’s dimensions seem identical (161.6 x 74.8 x 7.5 mm), save for a minor bump in weight (178g to 180g).\n\n For now there is no information on when the reworked nova 8 SE will be launched. Or whether it will be available outside of China, thought that seems unlikely seeing how the new nova 9 just reached Europe.",
    "userId": 1
  },
  {
    "title": "Xiaomi 12 lineup to feature curved displays, symmetrical speakers",
    "imgUrl": "https://fdn.gsmarena.com/imgroot/news/21/11/xiaomi-12-symmetrical-awd/-1200/gsmarena_002.jpg",
    "content": "Xiaomi is expected to unveil its 12 and 12X smartphones at an event in December, one a Snapdragon 8 Gen1 flagship and the other with a more modest Snapdragon 870.\n\n Now, adding to the rumored specs, popular Weibo insider Digital Chat Station shares that both phones will feature curved displays. Last year's Xiaomi 11 lineup featured a flat-sided Xiaomi Mi 11 and a curved Mi 11 Ultra.\n\n Another tidbit has to do with the speakers - according to the leaker, the Xiaomi 12 and 12X will feature symmetrical stereo speaker grilles, likely on the top and bottom of each phone. The speakers on the Mi 11 and Mi 11 Ultra are placed asymmetrically - the top speaker is on the left side, the bottom one is on the right side.\n\n The Xiaomi 12 will gain an updated 50MP main camera, a FHD+ AMOLED display of 120Hz refresh (which is a downgrade from the 1440p of the Mi 11), a larger optical fingerprint scanner and 100W charging.",
    "userId": 1
  },
  {
    "title": "Samsung Galaxy S21 family gets new stable One UI 4 build to fix lag issues",
    "imgUrl": "https://fdn.gsmarena.com/imgroot/news/21/11/one-ui-4-new-build-for-s21/inline/-1200/gsmarena_002.jpg",
    "content": "Just yesterday we let you know that Samsung acknowledged the lag issues plaguing some Galaxy S21 units, especially in the US, after being updated to the stable iteration of One UI 4 based on Android 12, the rollout of which started last week.\n\n And today the company already has the fix out. The issue was that when having selected 120 Hz in Settings, the refresh rate would revert to 60 Hz once the user stopped touching the screen - this resulting in a lot of perceived lag.\n\n The new build is G99xUSQU4BUK9 (where 'x' is different according to which S21 family member you have), and it's coming to replace the previous G99xUSQU4BUK7 on US carrier models. For now, the new build showed up at Verizon, but we expect it to reach the other carriers' units very soon.\n\n As the aforementioned refresh rate switching bug seems to mostly affect US units of the Galaxy S21, S21+, and S21 Ultra, it remains to be seen whether this software patch will be sent out globally in due course or not. People who have already installed it report a major improvement in the overall responsiveness of the phone, albeit there's apparently still some residual scrolling lag in third-party apps.",
    "userId": 1
  },
  {
    "title": "New Oppo to be named K9x, incoming on December 12",
    "imgUrl": "https://fdn.gsmarena.com/imgroot/news/21/11/oppo-k9x-specs/inline/-1200/gsmarena_002.jpg",
    "content": "An Oppo smartphone from the K9 family appeared on TENAA last week, and leaksters in China claim the new device will be called Oppo K9x. It resembles the Realme Q3 from the outside but it is an entirely different device under the shell with a Dimensity 900 chipset.\n\n The new phone is said to arrive for sale on December 12 with three memory variations and affordable prices.\n\n Most of the specs sheet was already revealed on TENAA - 6.5” LCD with Full HD+ resolution and a 16 MP selfie camera behind the punch hole. The leakster claims the panel will support a 120 Hz refresh rate, while the sensor for the front-facing cam will be a Sony IMX471.\n\n The 64 MP main snapper will have an OmniVision OM64B sensor with 0.7 μm-sized pixels and 1/1.97” size. The 5,000 mAh battery will be charged through the USB-C port, and Oppo will bring 30W VOOC 4.0 fast charging. The Oppo K9x will reportedly miss on NFC and IR port, limiting the options to use the phone as a digital wallet and an all-in-one remote.\n\n Oppo will reportedly sell the K9x with 6/128 GB for CNY1,499, while the 8/128 GB version will be CNY1,699. Doubling the storage, but keeping the 8 GB RAM will be CNY1,899. Users will be able to save CNY100 if they are among the early birds.",
    "userId": 1
  }
]
